<!doctype html>
<html lang="en">
  <head>
    <meta charset="utf-8">
    <meta name="viewport" content="width=device-width, initial-scale=1">
    <link rel="icon" href="favicon.ico" type="image/x-icon" />

    <link href="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/css/bootstrap.min.css" rel="stylesheet" integrity="sha384-EVSTQN3/azprG1Anm3QDgpJLIm9Nao0Yz1ztcQTwFspd3yD65VohhpuuCOmLASjC" crossorigin="anonymous">

    <title>Trouble in Terrorist Town | Balting Gaming</title>
  </head>
  <body style="background-color: rgb(36, 33, 33)">

    <nav class="navbar navbar-expand-lg navbar-dark bg-dark">
      <div class="container-fluid">
        <a class="navbar-brand" href="/">
          <img style="border-radius: 15%" src="logo.png" alt="" width="30" height="30" class="d-inline-block align-text-top">
          Baltic Gaming
        </a>
        <button class="navbar-toggler" type="button" data-bs-toggle="collapse" data-bs-target="#navbarSupportedContent" aria-controls="navbarSupportedContent" aria-expanded="false" aria-label="Toggle navigation">
          <span class="navbar-toggler-icon"></span>
        </button>
        <div class="collapse navbar-collapse" id="navbarSupportedContent">
          <ul class="navbar-nav me-auto mb-2 mb-lg-0">
            <!-- <li class="nav-item">
              <a class="nav-link active" aria-current="page" href="/">Home</a>
            </li> -->
            <li class="nav-item">
              <a class="nav-link" href="https://discord.gg/EtkzjtSxDe" target="_blank">Discord</a>
            </li>
          </ul>
        </div>
      </div>
    </nav>

    <div class="alert alert-success" role="alert" style="margin-left: 5%; margin-right: 5%; margin-top: 10px">
      <p><strong>TTT informacija ir taisyklės</strong></p>
<p><strong>Rolės ir jų tikslai</strong></p>
<p><strong>Detektyvas</strong>: I&scaron;gyventi bei i&scaron;siai&scaron;kinti kas yra&nbsp;i&scaron;davikas&nbsp;bei jį nužudyti. Visi žino kas tokie yra&nbsp;detektyvai, dėl to jais gali pasitikėti. Kad detektyvas galėtų privačiai bendrauti su kitais&nbsp;detektyvais, jis gali ra&scaron;yti kaip komandai.</p>
<p><strong>Civilis (Innocent)</strong>: I&scaron;gyventi, i&scaron;siai&scaron;kinti kas toks yra&nbsp;i&scaron;davikas, jį nužudyti ir nesukelti įtarimų kitiems, kad nemirtumėte.</p>
<p><strong>I&scaron;davikas (Traitor)</strong>:&nbsp;I&scaron;daviko&nbsp;tikslas yra kartu su kitais&nbsp;i&scaron;davikais&nbsp;nužudyti visus&nbsp;civilius,&nbsp;detektyvus&nbsp;ir nei&scaron;siduoti, kad jūs esate&nbsp;i&scaron;davikas. Kad galėtumėte bendrauti su kitais i&scaron;davikais nesužinant&nbsp;civiliams, jūs galite ra&scaron;yti kaip komandai arba naudoti komanda /tvoice.</p>
<hr>
<p><strong>Pagrindinės savokos ir daiktai</strong></p>
<ul>
<li>Karma: ta&scaron;kai, kuriuos galite gauti už gerai nuveiktus veiksmus ar prarasti už blogus sprendimus. Visi žaidėjai atėję į serverį pradeda su 30 karmos. Didžiausia karma, kurią gali žaidėjas pasiekti yra 75. Jeigu žaidėjo karma nukrenta mažiau 20, jis nebegali tapti&nbsp;detektyvu, jei žaidėjo karma tampa 15, jis gauna savaitės baną.
<ul>
<li>Kaip žaidėjas gali prarasti karmą: jeigu&nbsp;civilis&nbsp;nužudo kitą&nbsp;civilį, jeigu&nbsp;detektyvas&nbsp;nužudo kitą&nbsp;detektyvą, jeigu&nbsp;i&scaron;davikas&nbsp;nužudo kitą&nbsp;i&scaron;daviką, jeigu detektyvas nužudo&nbsp;civilį.</li>
<li>Kaip žaidėjas gali pasikelti karmos ta&scaron;kus: jeigu&nbsp;civilis/detektyvas&nbsp;nužudo&nbsp;i&scaron;daviką, jeigu&nbsp;i&scaron;davikas&nbsp;nužudo&nbsp;detektyvą/civilį.</li>
</ul>
</li>
<li>RDM&nbsp;(Random Death Match): Kai žaidėjas &scaron;audo bet ką, be priežasties, nežinodamas jis yra&nbsp;i&scaron;davikas&nbsp;ar ne.</li>
<li>Logs: sara&scaron;as, kurį kiekvienas žaidėjas gali patikrinti savo consolėje žaidimo pabaigoje. &Scaron;is sara&scaron;as rodo kas į ką &scaron;ovė, kas ką patikrino ir t.t.</li>
<li>Props: Daiktai, kuriuos žaidėjai gali pakelti su lazeriu.</li>
<li>Parduotuvė: Vieta, kur žaidėjai gali i&scaron;leisti savo kreditus mainais į daiktus, kurie galėtų jiems padėti laimėti žaidimą. Atsidaryti parduotuvę jums reikia para&scaron;yti vieną komandą: <strong>!shop</strong></li>
<li>Kreditai: Valiuta, kuriuos gauname už gerai atliktus veiksmus bei kuriuos prarandame už blogus sprendimus. &Scaron;iuos pinigus galime i&scaron;leisti parduotuvėje. Savo kreditus galite sužinoti para&scaron;ę !credits arba atidarę parduotuvę.</li>
<li>Tazeris: Trumpo atstumo &scaron;aunamasis ginklas, kurį galima nusipirkti parduotuvėje už kreditus ir su kuriuo pataikius į kitus žaidėjus, gauname žinutę jis buvo i&scaron;davikas ar ne.</li>
<li>Teleportacija: Pirkinys, kurį&nbsp;i&scaron;davikai&nbsp;gali nusipirkti i&scaron; parduotuvės. Nusipirkus &scaron;į daiktą,&nbsp;i&scaron;davikas&nbsp;para&scaron;ęs /tele galės atsiteleportuoti į tą vietą, kurioje nusipirko &scaron;į pirkinį. Atsiteleportuoti nusipirkus ,,Teleportaciją" galima tik 2 kartus.</li>
<li>DNA scaneris: Pirkinys, kurį detektyvai gali nusipirkti i&scaron; parduotuvės. Patikrinus kūną su juo, detektyvui rodomas žudikas.</li>
<li>Bomba: C4 bomba, kurią žaidėjai gali padėti ir pasirinkti laiką už kurio ji turėtų sprogti ir nužudyti visus &scaron;alia jos (Laikas gali būti: 15,20,25,30,35,40 sekundžių). Kai i&scaron;davikas padeda bomba, jūs ją galite i&scaron;minuoti priėję prie jos ir paspaudę SHIFT + R, jūsų ekrane atsiras lentelė, kur galėsite spėti kuris laidas i&scaron;minuos bombą (yra 3 laidai), bet jeigu neatspėsite, būsite i&scaron; karto nužudyti.</li>
<li>Savižudis:&nbsp;I&scaron;davikas&nbsp;gali nusipirkti &scaron;į pirkinį ir už 75 sekundžių i&scaron;girs garsą, kuris reik&scaron;, kad jo bomba yra paruo&scaron;ta. Du kartus nuspaudus F, &scaron;is žaidėjas sprogs ir mirs, taip pat nužudant visus aplink jį.</li>
</ul>
<hr>
<p><strong>TTT Pagrindinės taisyklės</strong></p>
<ol>
<li>Žaidėjai negali ,,prop surfinti" (lazerio ir daikto žemėlapyje pagalba skraidyti ar užsilipti ten, kur paprastai žaidėjas neužsiliptų).</li>
<li><strong>Draudžiama duoti bet kokią informaciją gyviems, jeigu esate miręs (kas jus nužudė, kur slepiasi žaidėjai ir t. t.).</strong></li>
<li>Draudžiama blokuoti žaidėjus su daiktais (į tai įeina paėmimas bet kokio daikto i&scaron; žemėlapio su lazeriu ir jų pagalba neleisti žaidėjams pajudėti).</li>
<li>Visi gali naudoti tazerį&nbsp;į jus&nbsp;be jokio leidimo ir jūs už tai jo negalite nužudyti (nebent esate&nbsp;i&scaron;davikas).</li>
<li>Draudžiama atlikti i&scaron;daviko akto, jei nesate i&scaron;davikas. Plačiau apie juos skaitykite žemiau.</li>
<li>Draudžiama apkaltinti kitą žaidėja be svarios priežasties arba sakyti, kad žaidėjas yra&nbsp;i&scaron;davikas, nors jūs to nežinote (nebent pats esate&nbsp;i&scaron;davikas).</li>
<li>Jei lieka mažai laiko raundui ir žaidėjai neranda vienas kito, administratoriai gali įjungti ,,beacons".</li>
</ol>
<hr>
<p><strong>Detektyvai (Detective)</strong></p>
<ol>
<li>Detektyvai&nbsp;negali įsakinėti žaidėjams ką jiems daryti ir nu&scaron;auti žaidėjus, jei nevykdo jų komandų.</li>
<li>Detektyvams&nbsp;draudžiama vykdyti&nbsp;i&scaron;daviko aktus, nors visi žino, kad jie detektyvai.</li>
<li>Detektyvas negali sukelti RDM.</li>
</ol>
<p><strong>Civiliai (Innocent)</strong></p>
<ol>
<li>Civiliai&nbsp;privalo tikrinti kūnus, nebent liko du žaidėjai (civilis prie&scaron;&nbsp;i&scaron;daviką) ir&nbsp;civilis&nbsp;nenori i&scaron;siduoti.</li>
<li>Civilis&nbsp;privalo bent kas 60 sekundžių pakeisti pozicija. Pozicijos keitimas rei&scaron;kia nestovėjimas viename kambaryje ir laukimas kol ateis traitorius, bet vaik&scaron;čiojimas po visą žemėlapį, kad ir i&scaron; lėto.</li>
<li>Civilis&nbsp;negali pradėti &scaron;audyti visų aplinkui ir taip sudaryti RDM.</li>
<li>Jeigu matote žaidėją &scaron;alia nepatikrinto kūno, privalote duoti jam laiko &scaron;į kūną patikrinti arba įspėti žaidėją, kad &scaron;is patikrintų kūną. Jei žaidėjas to neįvykdo nors turėjo pakankamai laiko, jį galima nu&scaron;auti.</li>
<li>Civiliai negali mėtyti granatų aplink kitus žaidėjus, &scaron;audyti &scaron;alia kitų žaidėjų ir pan. bandant sukelti chaosą arba bandant priversti kitą žaidėją jus nužudyti.</li>
<li>Civiliai&nbsp;negali sužeisti&nbsp;detektyvo&nbsp;ar kitų&nbsp;civilių&nbsp;(įskaitant su lazeriu ir daiktais žemėlapyje).</li>
<li>Civilis&nbsp;negali nužudyti žmogaus už jo nurodymų nesilaikymo.</li>
<li>Civilis&nbsp;gali nužudyti kitą žaidėją, jei jis ivykdo traitoriaus aktą.</li>
<li>Civilis&nbsp;privalo nužudyti&nbsp;i&scaron;daviką, kuris buvo ai&scaron;kiai i&scaron;ai&scaron;kintas.&nbsp;</li>
<li>Civiliai&nbsp;negali sakyti, kad jie&nbsp;i&scaron;davikai.</li>
</ol>
<p><strong>I&scaron;davikai (Traitor)</strong></p>
<ol>
<li>I&scaron;davikai&nbsp;negali slėptis viename kambaryje nekeičiant pozicijų ilgiau negu 45 sekundes (nebent tai žemėlapio pradžia ir dar daug žaidėjų gyvų arba jei laukia tinkamos progos nužudyti kitą žaidėją).</li>
<li>I&scaron;davikai&nbsp;negali i&scaron;duoti kitų i&scaron;davikų.</li>
<li>I&scaron;davikai&nbsp;negali specialiai nužudyti ar nuimti gyvybių kitam i&scaron;davikui.</li>
<li>I&scaron;davikai&nbsp;turi teisę tyliai tikrinti kūnus (chate niekas nesužinos, kad jūs patikrinote kūną) naudojant <strong>SHIFT + E</strong>.</li>
<li>I&scaron;davikai&nbsp;neprivalo tikrinti kūnų.</li>
<li>I&scaron;davikai&nbsp;negali užtrukti&nbsp;i&scaron;daviko&nbsp;kambaryje ilgiau nei 15 sekundžių.</li>
<li>I&scaron;davikas negali i&scaron;siduoti kitam žaidėjui, kad yra i&scaron;davikas ir taip dirbti kartu nežudant vienas kito.</li>
<li>I&scaron;davikai negali &scaron;audyti i&scaron; traitor kambario per sieną.</li>
<li>I&scaron;davikas negali campinti.</li>
</ol>
<hr>
<p><strong>I&scaron;daviko (Traitor) aktai</strong></p>
<ol>
<li>Ai&scaron;kus pjaustymas aplink žaidėją, bandant jį papjauti.</li>
<li>Kūnų netikrinimas.</li>
<li>&Scaron;audymas aplink kitus žaidėjus (nebent savigynai).</li>
<li>Naudojant daiktus, kuriuos galima gauti TIK i&scaron;&nbsp;i&scaron;daviko&nbsp;parduotuvės.</li>
<li>C4 bombos padėjimas ar savęs susisprogdinimas (ar tiesiog užtaisymo garsas) Savižudžio bombos.</li>
<li>Pastovus žaidėjų įkalinimas.</li>
<li>Žaidėjo nepraleidimas į tam tikrą vietą.</li>
<li>I&scaron;daviko&nbsp;kambario atidarymas.</li>
<li>C4 ne&scaron;iojimas ar metimas link kitų žaidėjų</li>
<li>I&scaron;daviko&nbsp;daiktų slėpimas (nebent tai žalojanti vaistinėlė, nuodai ar kažkas pan.)</li>
<li>Nepatikrintų kūnų ignoravimas/neidentifikavimas (reikia bandyti žaidėją bent įspėti apie nepatikrintą kūną).</li>
<li>Jei žaidėjas pats prisipažįsta, kad jis yra&nbsp;i&scaron;davikas,&nbsp;civiliai&nbsp;bei&nbsp;detektyvai&nbsp;turi teise jį nu&scaron;auti.</li>
</ol>
<p><strong>Įtartini aktai</strong></p>
<ol>
<li>Bandymas suprie&scaron;inti visus žaidėjus prie&scaron;&nbsp;civilį.</li>
<li>Kito žaidėjo kaltinimas be svarios priežasties.</li>
<li>Tylus kūnų tikrinimas.</li>
<li>Kūnų slėpimas</li>
<li>Tyčinis dėmėsio nukreipimas nuo&nbsp;i&scaron;daviko.</li>
<li>Netikros informacijos dalinimas.</li>
<li>Apsimetinėjimas esant mirusiam.&nbsp;<strong>&nbsp;</strong></li>
</ol>
    </div>

    <script src="https://cdn.jsdelivr.net/npm/bootstrap@5.0.2/dist/js/bootstrap.bundle.min.js" integrity="sha384-MrcW6ZMFYlzcLA8Nl+NtUVF0sA7MsXsP1UyJoMp4YLEuNSfAP+JcXn/tWtIaxVXM" crossorigin="anonymous"></script>
  </body>
</html>
